---
kind: property
id: P:Autodesk.Revit.DB.NavisworksExportOptions.ExportScope
source: html/3a7ffc07-bd02-39c2-1846-865973db8d7f.htm
---
# Autodesk.Revit.DB.NavisworksExportOptions.ExportScope Property

Options which specifies the export scope of Navisworks Exporter.
 Default value is Model.

## Syntax (C#)
```csharp
public NavisworksExportScope ExportScope { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration